Tekla.Structures.Analysis.AnalysisDecomposedLoad
The AnalysisDecomposedLoad class contains information related to decomposed loads.

Tekla.Structures.Analysis.AnalysisDecomposedLoad._ObjectAttachedToID
The identifier of the object the load is attached to.

Tekla.Structures.Analysis.AnalysisDecomposedLoad._ObjectAttachedToType
The type of the object the load is attached to.

Tekla.Structures.Analysis.AnalysisDecomposedLoad._ModelLoadID
The identifier of the model load.

Tekla.Structures.Analysis.AnalysisDecomposedLoad._ModelLoadGroupID
The identifier of the model load group.

Tekla.Structures.Analysis.AnalysisDecomposedLoad._AnalysisLoadType
The load type of the analysis decomposed load.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.ObjectAttachedToID
The identifier of the object the load is attached to.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.ObjectAttachedToType
The type of the object the load is attached to.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.ModelLoadID
The identifier of the model load.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.ModelLoadGroupID
The identifier of the load group.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadType
The type of the analysis decomposed load.